# Origin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClipPlane..::..Origin Property
ClipPlane Class See Also
---
The plane's origin.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public XYZ Origin { get; set; }
```

Visual Basic
---
```text
Public Property Origin As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ClipPlane Class
Autodesk.Revit.DB.DirectContext3D Namespace